# Dataframe

It is a table, it has rows and columns. Every column is a series and every row consists of series elements. A DataFrame can be constructed using in-built Python dicts.

In [1]:
import pandas as pd

df = pd.DataFrame({"country":["India","Russia","Belarus","Ukraine"],
                  "Population":[125.04,143.5,9.5,45.5],
                  "Square":[2724902,17125191,205600,603628]})
df #use this instead of print otherwise it prints in a weird manner

   country  Population    Square
0    India      125.04   2724902
1   Russia      143.50  17125191
2  Belarus        9.50    205600
3  Ukraine       45.50    603628

In [2]:
#In order to make sure each column is a series

df["country"]

0      India
1     Russia
2    Belarus
3    Ukraine
Name: country, dtype: object

In [3]:
type(df["country"])

pandas.core.series.Series

In [4]:
df.columns #Returns the headings as an index object

Index(['country', 'Population', 'Square'], dtype='object')

In [5]:
type(df.columns)

pandas.core.indexes.base.Index

In [6]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
print(df.index)

RangeIndex(start=0, stop=4, step=1)

# Accessing elements by index
There are numerous ways to provide row index explicitly, for example you can provide index when creating a DataFrame or do it “on the fly” during runtime:

In [8]:
#Can do it on creation

import pandas as pd

df = pd.DataFrame({"country":["India","Russia","Belarus","Ukraine"],
                  "Population":[125.04,143.5,9.5,45.5],
                  "Square":[2724902,17125191,205600,603628]}, index = ["IND","RU","BY","UA"])
df

     country  Population    Square
IND    India      125.04   2724902
RU    Russia      143.50  17125191
BY   Belarus        9.50    205600
UA   Ukraine       45.50    603628

In [9]:
#On the fly index creation

df.index = ["IND","RU","BY","UA"] #Can use any data structure but keep it limited to lists as a standard
df.index.name = "Country Code"

df

              country  Population    Square
Country Code
IND             India      125.04   2724902
RU             Russia      143.50  17125191
BY            Belarus        9.50    205600
UA            Ukraine       45.50    603628

In [10]:
df["country"]

Country Code
IND      India
RU      Russia
BY     Belarus
UA     Ukraine
Name: country, dtype: object

# Row access using index

1. Using .loc and providing index label
2. Using .iloc and providing index number

In [11]:
import pandas as pd

df = pd.DataFrame({"country":["India","Russia","Belarus","Ukraine"],
                  "Population":[125.04,143.5,9.5,45.5],
                  "Square":[2724902,17125191,205600,603628]}, index = ["IND","RU","BY","UA"])

df

     country  Population    Square
IND    India      125.04   2724902
RU    Russia      143.50  17125191
BY   Belarus        9.50    205600
UA   Ukraine       45.50    603628

In [12]:
df.loc["IND"] #Using index label

country         India
Population     125.04
Square        2724902
Name: IND, dtype: object

In [13]:
df.iloc[0] #Using index number

country         India
Population     125.04
Square        2724902
Name: IND, dtype: object

In [14]:
df.loc[["IND","RU"],"Population"] #Returns columns inparticular, based on index

IND    125.04
RU     143.50
Name: Population, dtype: float64

In [15]:
df.loc[["IND","RU"],["Population","Square"]]

     Population    Square
IND      125.04   2724902
RU       143.50  17125191

In [16]:
df.loc["IND":"BY", :]  # [Rows, Columns]

     country  Population    Square
IND    India      125.04   2724902
RU    Russia      143.50  17125191
BY   Belarus        9.50    205600

In [17]:
#Filtering using boolean arrays

df[df.Population>10][["country","Square"]]

     country    Square
IND    India   2724902
RU    Russia  17125191
UA   Ukraine    603628

In [18]:
#Getting a boolean array

df.Population>10

IND     True
RU      True
BY     False
UA      True
Name: Population, dtype: bool

In [19]:
#Using the above boolean array as index

df[df.Population>10]

     country  Population    Square
IND    India      125.04   2724902
RU    Russia      143.50  17125191
UA   Ukraine       45.50    603628

In [20]:
#Resetting index

df.reset_index()

  index  country  Population    Square
0   IND    India      125.04   2724902
1    RU   Russia      143.50  17125191
2    BY  Belarus        9.50    205600
3    UA  Ukraine       45.50    603628

When you manipulate a Dataframe, pandas will return a new instance

In [21]:
#Adding a new column of Density using equation

df["Density"] = df["Population"] / df["Square"] * 1000000

df

     country  Population    Square    Density
IND    India      125.04   2724902  45.887889
RU    Russia      143.50  17125191   8.379469
BY   Belarus        9.50    205600  46.206226
UA   Ukraine       45.50    603628  75.377550

In [22]:
#Delete columns using drop

df.drop(["Density"], axis="columns")

     country  Population    Square
IND    India      125.04   2724902
RU    Russia      143.50  17125191
BY   Belarus        9.50    205600
UA   Ukraine       45.50    603628

In [23]:
df = df.rename(columns = {"country":"Country"})

df

     Country  Population    Square    Density
IND    India      125.04   2724902  45.887889
RU    Russia      143.50  17125191   8.379469
BY   Belarus        9.50    205600  46.206226
UA   Ukraine       45.50    603628  75.377550

# Concatenating DataFrames
A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. We can join, merge, and concat dataframe using different methods. In Dataframe df.merge(), df.join() and df.concat() methods help in joining, merging and concating different dataframe.

In order to concat dataframe, we use concat() function which helps in concatenating a dataframe. We can concat a dataframe in many different ways, they are:

1- Concatenating DataFrame using .concat()
2- Concatenating DataFrame by setting logic on axes
3- Concatenating DataFrame using .append()
4- Concatenating DataFrame by ignoring indexes
5- Concatenating DataFrame with group keys
6- Concatenating with mixed ndims

In [24]:
import pandas as pd

data1 = {"Name":["Rahul","Princi","Gaurav","Anuj"],
        "Age":[21,22,23,24],
        "Address":["Noxus","Ionia","Freljord","Demacia"],
        "Qualification":["Assassin","Bruiser","Marksman","Tank"]}

data2 = {"Name":["Talon","Zed","Quinn","Kennen"],
        "Age":[25,26,27,28],
        "Address":["Shurima","Targon","Icathia","Isles"],
        "Qualification":["Support","Mid","Jungler","ADC"]}

df1 = pd.DataFrame(data1, index=[1,2,3,4])

df2 = pd.DataFrame(data2, index=[5,6,7,8])

print(df1)
print("\n\n")
print(df2)

     Name  Age   Address Qualification
1   Rahul   21     Noxus      Assassin
2  Princi   22     Ionia       Bruiser
3  Gaurav   23  Freljord      Marksman
4    Anuj   24   Demacia          Tank



     Name  Age  Address Qualification
5   Talon   25  Shurima       Support
6     Zed   26   Targon           Mid
7   Quinn   27  Icathia       Jungler
8  Kennen   28    Isles           ADC

Now we apply .concat function to concatenate two dataframes

In [25]:
frames = [df1,df2]

dfc = pd.concat(frames)
dfc

     Name  Age   Address Qualification
1   Rahul   21     Noxus      Assassin
2  Princi   22     Ionia       Bruiser
3  Gaurav   23  Freljord      Marksman
4    Anuj   24   Demacia          Tank
5   Talon   25   Shurima       Support
6     Zed   26    Targon           Mid
7   Quinn   27   Icathia       Jungler
8  Kennen   28     Isles           ADC

# Concat using logics on axes

In order to concat dataframe, we have to set different logic on axes. We can set axes in the following three ways:

1- Taking the union of them all, join='outer'. This is the default option as it    results in zero information loss.

2- Taking the intersection, join='inner'.

3- Use a specific index, as passed to the join_axes argument

In [26]:
import pandas as pd

data1 = {"Name":["Rahul","Princi","Gaurav","Anuj"],
        "Age":[21,22,23,24],
        "Address":["Noxus","Ionia","Freljord","Demacia"],
        "Qualification":["Assassin","Bruiser","Marksman","Tank"],
        "Mobile number":[12345678,12345678,12345678,12345678]}

data2 = {"Name":["Talon","Zed","Quinn","Kennen"],
        "Age":[25,26,27,28],
        "Address":["Shurima","Targon","Icathia","Isles"],
        "Qualification":["Support","Mid","Jungler","ADC"],
        "Salary":[12000,22000,32000,42000]}

df1 = pd.DataFrame(data1, index=[1,2,3,4])

df2 = pd.DataFrame(data2, index=[5,6,7,8])

print(df1)
print("\n\n")
print(df2)

     Name  Age   Address Qualification  Mobile number
1   Rahul   21     Noxus      Assassin       12345678
2  Princi   22     Ionia       Bruiser       12345678
3  Gaurav   23  Freljord      Marksman       12345678
4    Anuj   24   Demacia          Tank       12345678



     Name  Age  Address Qualification  Salary
5   Talon   25  Shurima       Support   12000
6     Zed   26   Targon           Mid   22000
7   Quinn   27  Icathia       Jungler   32000
8  Kennen   28    Isles           ADC   42000

In [27]:
#Joining axes with join = inner for intersection of dataframes

dfi = pd.concat([df1,df2], axis=1, join="inner")

dfi

Empty DataFrame
Columns: [Name, Age, Address, Qualification, Mobile number, Name, Age, Address, Qualification, Salary]
Index: []

In [28]:
# join = outer for union of dataframes

dfu = pd.concat([df1,df2], axis=1, join="outer")

dfu

,Name,Age,Address,Qualification,Mobile number,Name,Age,Address,Qualification,Salary
1,Rahul,21.0,Noxus,Assassin,12345678.0,NaN,NaN,NaN,NaN,NaN
2,Princi,22.0,Ionia,Bruiser,12345678.0,NaN,NaN,NaN,NaN,NaN
3,Gaurav,23.0,Freljord,Marksman,12345678.0,NaN,NaN,NaN,NaN,NaN
4,Anuj,24.0,Demacia,Tank,12345678.0,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,Talon,25.0,Shurima,Support,12000.0
6,NaN,NaN,NaN,NaN,NaN,Zed,26.0,Targon,Mid,22000.0
7,NaN,NaN,NaN,NaN,NaN,Quinn,27.0,Icathia,Jungler,32000.0
8,NaN,NaN,NaN,NaN,NaN,Kennen,28.0,Isles,ADC,42000.0

In [29]:
#Using join_axes to return a specific index

dfind = pd.concat([df1,df2], axis=1, join_axes=[df1.index]) #returns a union filtered with the index of df1

dfind

,Name,Age,Address,Qualification,Mobile number,Name,Age,Address,Qualification,Salary
1,Rahul,21,Noxus,Assassin,12345678,NaN,NaN,NaN,NaN,NaN
2,Princi,22,Ionia,Bruiser,12345678,NaN,NaN,NaN,NaN,NaN
3,Gaurav,23,Freljord,Marksman,12345678,NaN,NaN,NaN,NaN,NaN
4,Anuj,24,Demacia,Tank,12345678,NaN,NaN,NaN,NaN,NaN

# Concatenating dataframes using append

In order to concat a dataframe, we use .append() function this function concatenate along axis=0, namely the index. This function exist before .concat()

In [11]:
import pandas as pd

data1 = {"Name":["Rahul","Princi","Gaurav","Anuj"],
        "Age":[21,22,23,24],
        "Address":["Noxus","Ionia","Freljord","Demacia"],
        "Qualification":["Assassin","Bruiser","Marksman","Tank"]}

data2 = {"Name":["Talon","Zed","Quinn","Kennen"],
        "Age":[25,26,27,28],
        "Address":["Shurima","Targon","Icathia","Isles"],
        "Qualification":["Support","Mid","Jungler","ADC"]}

df1 = pd.DataFrame(data1, index=[1,2,3,4])

df2 = pd.DataFrame(data2, index=[5,6,7,8])

print(df1)
print("\n\n")
print(df2)

     Name  Age   Address Qualification
1   Rahul   21     Noxus      Assassin
2  Princi   22     Ionia       Bruiser
3  Gaurav   23  Freljord      Marksman
4    Anuj   24   Demacia          Tank



     Name  Age  Address Qualification
5   Talon   25  Shurima       Support
6     Zed   26   Targon           Mid
7   Quinn   27  Icathia       Jungler
8  Kennen   28    Isles           ADC

In [12]:
#Concatenating the dataframes using append()

dfa = df1.append(df2, sort="True")

dfa

    Address  Age    Name Qualification
1     Noxus   21   Rahul      Assassin
2     Ionia   22  Princi       Bruiser
3  Freljord   23  Gaurav      Marksman
4   Demacia   24    Anuj          Tank
5   Shurima   25   Talon       Support
6    Targon   26     Zed           Mid
7   Icathia   27   Quinn       Jungler
8     Isles   28  Kennen           ADC

# Concatenating DataFrame by ignoring indexes

In order to concatenate a dataframe by ignoring indexes, we ignore index which don't have a meaningful meaning. You may wish to append them and ignore the fact that they may have overlapping indexes. In order to do that, we use ignore_index as an argument.

In [13]:
import pandas as pd

data1 = {"Name":["Rahul","Princi","Gaurav","Anuj"],
        "Age":[21,22,23,24],
        "Address":["Noxus","Ionia","Freljord","Demacia"],
        "Qualification":["Assassin","Bruiser","Marksman","Tank"]}

data2 = {"Name":["Talon","Zed","Quinn","Kennen"],
        "Age":[25,26,27,28],
        "Address":["Shurima","Targon","Icathia","Isles"],
        "Qualification":["Support","Mid","Jungler","ADC"]}

df1 = pd.DataFrame(data1, index=[1,2,3,4])

df2 = pd.DataFrame(data2, index=[5,6,7,8])

print(df1)
print("\n\n")
print(df2)

     Name  Age   Address Qualification
1   Rahul   21     Noxus      Assassin
2  Princi   22     Ionia       Bruiser
3  Gaurav   23  Freljord      Marksman
4    Anuj   24   Demacia          Tank



     Name  Age  Address Qualification
5   Talon   25  Shurima       Support
6     Zed   26   Targon           Mid
7   Quinn   27  Icathia       Jungler
8  Kennen   28    Isles           ADC

In [14]:
#Now using ignore_index

dfc = pd.concat([df1,df2], ignore_index=True)

dfc

     Name  Age   Address Qualification
0   Rahul   21     Noxus      Assassin
1  Princi   22     Ionia       Bruiser
2  Gaurav   23  Freljord      Marksman
3    Anuj   24   Demacia          Tank
4   Talon   25   Shurima       Support
5     Zed   26    Targon           Mid
6   Quinn   27   Icathia       Jungler
7  Kennen   28     Isles           ADC

As you can see, it ignores the original index and resets it

# Concatenating DataFrame with Group keys:

We override the column names with the use of the 'keys' argument.

In [16]:
frames = [df1,df2]

dfg = pd.concat(frames, keys=["df1","df2"])

dfg

         Name  Age   Address Qualification
df1 1   Rahul   21     Noxus      Assassin
    2  Princi   22     Ionia       Bruiser
    3  Gaurav   23  Freljord      Marksman
    4    Anuj   24   Demacia          Tank
df2 5   Talon   25   Shurima       Support
    6     Zed   26    Targon           Mid
    7   Quinn   27   Icathia       Jungler
    8  Kennen   28     Isles           ADC

# Concatenating with ndims (N-dimensions)

User can concat a mix of Series and DataFrames. The series will be transformed into DataFrame with the Series's name as the column name in the Dataframe

In [21]:
import pandas as pd

data1 = {"Name":["Talon","Zed","Quinn","Kennen"],
        "Age":[25,26,27,28],
        "Address":["Shurima","Targon","Icathia","Isles"],
        "Qualification":["Support","Mid","Jungler","ADC"]}

df1 = pd.DataFrame(data1, index=[0,1,2,3])

print(df1)
print("\n\n")

s1 = pd.Series([1000,2000,3000,4000], name = "Damage")
print(s1)
print(s1.name)

     Name  Age  Address Qualification
0   Talon   25  Shurima       Support
1     Zed   26   Targon           Mid
2   Quinn   27  Icathia       Jungler
3  Kennen   28    Isles           ADC



0    1000
1    2000
2    3000
3    4000
Name: Damage, dtype: int64
Damage

In [25]:
#Mixing Series and DataFrame together

dfc = pd.concat([df1,s1], axis=1) #axis=0 to add row

dfc

     Name  Age  Address Qualification  Damage
0   Talon   25  Shurima       Support    1000
1     Zed   26   Targon           Mid    2000
2   Quinn   27  Icathia       Jungler    3000
3  Kennen   28    Isles           ADC    4000

# Merging DataFrames

In [26]:
#Code 1: Merging a DataFrame with one unique key combination

import pandas as pd

data1 = {"key":["K0","K1","K2","K3"],
        "Name":["Talon","Zed","Kaisa","Karthus"],
        "Age":[25,45,22,400]}

data2 = {"key":["K0","K1","K2","K3"],
        "Name":["Hecarim","Kalita","Nasus","Jax"],
        "Age":[100,100,800,200]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

print(df1,"\n\n",df2)

  key     Name  Age
0  K0    Talon   25
1  K1      Zed   45
2  K2    Kaisa   22
3  K3  Karthus  400

   key     Name  Age
0  K0  Hecarim  100
1  K1   Kalita  100
2  K2    Nasus  800
3  K3      Jax  200

In [27]:
#Using merge() function

dfm = pd.merge(df1, df2, on="key")

dfm

  key   Name_x  Age_x   Name_y  Age_y
0  K0    Talon     25  Hecarim    100
1  K1      Zed     45   Kalita    100
2  K2    Kaisa     22    Nasus    800
3  K3  Karthus    400      Jax    200

# Questions

1: WAP to get the powers of an array element-wise (First array elements raised to the power of elements from second array)

Sample data:
{"X":[1,2,3,4,5],"Y":[6,7,8,9,10],"Z":[11,12,13,14,15]}

2: WAP to create and display a dataframe from a specified dictionary data which has the index labels.

Sample data:
exam_data = {"Name":[....],"Score":[10,...,np.nan,....19],"Attempts":[1,2,3,...],"Qualify":["yes"/"no"...],
            Labels=["a","b",...]

Expected output:
Attempts       Name       Qualify        Score

3: Write a pandas program to display a summary of the basic information about specified dataframe and its data.

4: Write a pandas program to get the first three rows of a given dataframe.

5: Write a pandas program to select the "name" and "score" columns from the given dataframe.

6: Write a pandas program to select the specified columns and rows from a given dataframe.

Example: Select "name" and "score", in rows 1,3,5,6

7: Write a pandas program to select the rows where the number of attemps in examination is greater than 2.

8. Write a pandas program to count the number of rows and columns of a dataframe.

9. WAPP to select the rows where the score is missing (np.nan)

10: WAPP to select the rows the score is between 15 and 20 (inclusive).

11: WAPP to select the rows where number of attempts is less than 2 and greater than 15

12: WAPP to change the score in row 'd' to 11.5

In [3]:
#WAP to get the powers of an array element-wise

import numpy as np
import pandas as pd

ar1 = np.array([1,2,3,4,5])
ar2 = np.array([6,7,8,9,10])

s1 = pd.Series(ar1)
s2 = pd.Series(ar2)

s3 = s1**s2

print(s3)

0          1
1        128
2       6561
3     262144
4    9765625
dtype: int32

In [26]:
#WAP to create and display a dataframe from a specified dictionary data which has the index labels

#Dictionary
exam_data = {"Name":["Sayantan","Vanshika","Gaurav","Gagan","Varun","Sahitya"],
            "Score":[11,17,13,np.nan,18,np.nan],
            "Attempts":[1,2,3,1,2,2],
            "Qualify":["yes","yes","yes","no","yes","no"]}
Labels=['a','b','c','d','e','f']

df = pd.DataFrame(exam_data, index=Labels)
df

       Name  Score  Attempts Qualify
a  Sayantan   11.0         1     yes
b  Vanshika   17.0         2     yes
c    Gaurav   13.0         3     yes
d     Gagan    NaN         1      no
e     Varun   18.0         2     yes
f   Sahitya    NaN         2      no

In [19]:
#WAP to display a summary of the Dataframe

print("DataFrame type:",type(df))    
print("Number of rows:",len(df.index))
print("Number of columns",len(df.columns)+1) #+1 for index as needed
print("Data type of elements:\n",df.dtypes)
print("The shape of Dataframe is:",df.shape)

DataFrame type: <class 'pandas.core.frame.DataFrame'>
Number of rows: 6
Number of columns 5
Data type of elements:
 Name         object
Score       float64
Attempts      int64
Qualify      object
dtype: object
The shape of Dataframe is: (6, 4)

In [61]:
#Write a pandas program to get the first three rows of a given dataframe

print(df[0:3])

       Name  Score  Attempts Qualify
a  Sayantan   11.0         1     yes
b  Vanshika   12.0         2     yes
c    Gaurav   13.0         3     yes

In [67]:
#5: Write a pandas program to select the "name" and "score" columns from the given dataframe.

df[["Name","Score"]]

       Name  Score
a  Sayantan   11.0
b  Vanshika   12.0
c    Gaurav   13.0
d     Gagan    NaN
e     Varun   14.0
f   Sahitya    NaN

In [73]:
#6: Write a pandas program to select the "name" and "score" columns from the given dataframe and row 1,3,5,6

df.loc[["a","c","e","f"],["Name","Score"]]

       Name  Score
a  Sayantan   11.0
c    Gaurav   13.0
e     Varun   14.0
f   Sahitya    NaN

In [5]:
#7: Write a pandas program to select the rows where the number of attemps in examination is greater than 2

print("The rows in which the number of attempts is more than 2 are:")
df[df.Attempts>2]

The rows in which the number of attempts is more than 2 are:

     Name  Score  Attempts Qualify
c  Gaurav   13.0         3     yes

In [6]:
#8: WAPP to count the number of rows and columns in a dataframe

print("The number of rows and columns are:", len(df.index), "&", len(df.columns))

The number of rows and columns are: 6 & 4

In [22]:
#9: WAPP to select the rows where the score is missing (np.nan)

df[df.Score == np.nan]

print(np.nan)

nan

In [31]:
#10: WAPP to select the rows the score is between 15 and 20 (inclusive)

df1 = df[df.Score >=15]
df2 = df[df.Score <=20] #large boolean algebra not working

df3 = pd.concat([df1,df2], axis=1, join="inner")
df3

       Name  Score  Attempts Qualify      Name  Score  Attempts Qualify
b  Vanshika   17.0         2     yes  Vanshika   17.0         2     yes
e     Varun   18.0         2     yes     Varun   18.0         2     yes

In [32]:
#11: WAPP to select the rows where number of attempts is less than 2 and greater than 15

df1 = df[df.Attempts < 2]
df2 = df[df.Attempts > 15] #large boolean algebra not working

df3 = pd.concat([df1,df2], axis=1, join="outer")
df3

C:\Users\msi1\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

       Name  Score  Attempts Qualify Name  Score  Attempts Qualify
a  Sayantan   11.0         1     yes  NaN    NaN       NaN     NaN
d     Gagan    NaN         1      no  NaN    NaN       NaN     NaN

In [37]:
#12: WAPP to change the score in row 'd' to 11.5

df.Score["d"] = 11.5

df

C:\Users\msi1\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

       Name  Score  Attempts Qualify
a  Sayantan   11.0         1     yes
b  Vanshika   17.0         2     yes
c    Gaurav   13.0         3     yes
d     Gagan   11.5         1      no
e     Varun   18.0         2     yes
f   Sahitya    NaN         2      no